{
	"avivAngular.content.context": "Group specialized in the publication of real estate advertisement websites",
	"avivAngular.content.project": "Management of the site dedicated to real estate professionals (back office) and the site for posting rental, life annuity and sales advertisements for professionals and individuals, within a multidisciplinary team of varying sizes over time (therefore an ability to work both in a fairly large team and as the sole front-end developer in the team)",
	"avivAngular.content.tasks.1": "Development, maintenance, optimization and testing of applications",
	"avivAngular.content.tasks.2": "Contribution, implementation of new functionalities (by creating high-level and low-level components; by writing and consuming utility services or communication with the backend, etc.) in a library architecture, in particular a UI library (design-system)",
	"avivAngular.content.tasks.3": "Technical development of application testing strategy architecture (unit, integration, e2e tests)",
	"avivAngular.content.tasks.4": "Documentation, coaching, technical support",
	"avivAngular.content.tasks.5": "Guild operations and participation in architectural decisions",
	"avivAngular.end-time": "September 2023",
	"avivAngular.enterprise": "Aviv Group",
	"avivAngular.start-time": "December 2018",
	"avivAngular.title": "Angular Frontend Developer (v6 - v17)",
	"avivReact.content.context": "Group specialized in the publication of real estate advertisement websites",
	"avivReact.content.project": "Management of the site dedicated to the acquisition of advertising spaces on the official sites of the AVIV group and distribution of advertising campaigns to Meta's social media (Facebook and Instagram)",
	"avivReact.content.tasks.1": "Creation and testing of components, hooks, etc.",
	"avivReact.content.tasks.2": "State management using contexts or consuming and hydrating stores (Redux)",
	"avivReact.content.tasks.3": "Use of a design system developed by a dedicated team",
	"avivReact.content.tasks.4": "Implementing iframe features for communicating a React app within an Angular app",
	"avivReact.content.tasks.5": "Guild operation, contribution to the implementation of cross-cutting subjects",
	"avivReact.end-time": "November 2024",
	"avivReact.enterprise": "Aviv Group",
	"avivReact.start-time": "September 2023",
	"avivReact.title": "Frontend React Developer (v18)",
	"by": "by",
	"content-actions.education-and-trainings": "Education and Training",
	"content-actions.languages": "Languages",
	"content-actions.professional-experiences": "Professional experiences",
	"content-actions.technical-skills": "Technical skills",
	"cvApp.content.context": "Personal project to showcase my technical expertise in web development",
	"cvApp.content.project": "Application serving as a resume to introduce myself and showcase my technical expertise in web programming. While waiting for the next opportunity, I started to develop this application with the aim of putting it online.",
	"cvApp.content.tasks.1": "Development, optimization of Frontend features and prolific use of the TailwindCSS library",
	"cvApp.content.tasks.2": "Implementation of the functionality to switch between light and dark modes",
	"cvApp.content.tasks.3": "Implementation of the language switching functionality (French, English, and Dutch)",
	"cvApp.content.tasks.4": "Development and optimization of the backend layer in NodeJS and ExpressJS",
	"cvApp.content.tasks.5": "Writing unit and visual integration tests on the Angular side",
	"cvApp.content.tasks.6": "Deployment / launching the application online",
	"cvApp.end-time": "January 2025",
	"cvApp.enterprise": "Personal Project",
	"cvApp.start-time": "January 2025",
	"cvApp.title": "Fullstack Angular (v19) / NodeJS developer",
	"education.institution": "The Hague University of Applied Sciences",
	"education.locality": "Delft",
	"education.section-title": "Education / Degree",
	"education.time": "September 2014",
	"education.title": "Electrical engineering",
	"education.type": "Bachelor",
	"experiences.context": "Context:",
	"experiences.project": "Project:",
	"experiences.tasks": "Tasks:",
	"experiences.till-now": "Now",
	"header.brightMode": "Bright mode",
	"header.darkMode": "Dark mode",
	"intro.firstParagraph": "I'm an experienced Frontend developer with 7 years' experience working with Angular (from v2-beta to v17).\n With a solid grounding in TypeScript, I've easily mastered the Swiss army knife that is Angular, and have a wealth of knowledge and best practices in its daily use; including a thorough understanding of component-based architecture, dependency injection and the use of decorators.",
	"intro.quote": "“Everything you have learned so far only makes sense if it has an application.”",
	"intro.secondParagraph": "When I started diving professionally into the React ecosystem a year ago, I wanted to explore its unique features and philosophies, such as the virtual DOM, TSX, the concepts of hooks, contexts, and other nuggets of this library.",
	"intro.subtitle": "Confirmed Angular Frontend Developer - 7 years of experience",
	"intro.thirdParagraph": "But since we have to make a choice! Today with the emergence of AI all around us, and in particular Github Copilot which wonderfully assists developers, Angular becomes even more attractive to me because of its completeness and the reduction of its 'complexity'. Since I now have the luxury of having my code co-piloted, it's better to do it on board of a big Airbus A380 for the challenge, that is to say the complete machine that Angular represents.",
	"languages.dutch": "Dutch:",
	"languages.english": "English:",
	"languages.french": "French:",
	"languages.item-title": "Language",
	"languages.verbalWeight-title": "Oral",
	"languages.writtenWeight-title": "Writing",
	"qDelft.content.context": "Web software publisher",
	"qDelft.content.project": "Teacher career management solution (300,000 teachers) for CIBG (part of the Dutch Ministry of Education, Sport and Welfare) within a team of 15 people including 8 developers",
	"qDelft.content.tasks.1": "Creation of reusable components within a UI library",
	"qDelft.content.tasks.2": "Implementation of multiple features (including asynchronous search within the application, activity sharing between users, registration functionality, etc.)",
	"qDelft.end-time": "October 2018",
	"qDelft.enterprise": "QDelft BV",
	"qDelft.start-time": "March 2017",
	"qDelft.title": "Angular  (v2 - v5)/.Net Developer",
	"rights-reserved": "All rights reserved. I agree that my personal data will be processed as part of the recruitment process for the job I am applying for.",
	"skills-table.challenges": "Challenges",
	"skills-table.no": "No",
	"skills-table.practicalWeight": "Much applied in practice",
	"skills-table.skill": "Skill",
	"skills-table.theoryWeight": "Good theoretical notions",
	"skills-table.usedInThisApp": "Used in this resume application",
	"skills-table.yes": "Yes",
	"trainings.angular.advanced": "Angular - Advanced ",
	"trainings.angular.complete-guide": "Angular – The Complete Guide (2024 Edition)",
	"trainings.angular.crash-course": "Angular Crash Course for Busy Developers",
	"trainings.mvc.asp-net": "The Complete ASP.NET MVC 5 Course",
	"trainings.node": "Node.JS",
	"trainings.title": "Trainings"
}
