{
	"an-error-occured": "Une erreur est survenue; veuillez réessayer plus tard.",
	"avivAngular.content.context": " Groupe spécialisé dans l'édition de sites web d’annonces immobilières",
	"avivAngular.content.project": " Gestion du site dédié aux professionnels de l’immobilier (back-office) et du site de dépôt d’annonces de location, viager et vente de professionnels comme de particuliers, au sein d’une équipe pluridisciplinaire de taille assez variante dans le temps (donc une aptitude à travailler autant dans une équipe d’envergure assez conséquente que travailler comme seul développeur front de l’équipe)",
	"avivAngular.content.tasks.1": "Développement, maintien, optimisation et test d'applications",
	"avivAngular.content.tasks.2": "Contribution, implémentation de nouvelles fonctionnalités (en créant des composants de haut, bas niveaux; en écrivant et consommant des services \nutilitaires ou de communication avec le backend, etc.) dans une architecture de librairies, notamment une librairie UI (design-system)",
	"avivAngular.content.tasks.3": " Élaboration technique d'architecture de stratégie de tests d'applications (tests unitaires, d'intégration, e2e)",
	"avivAngular.content.tasks.4": "Documentation, coaching, soutien technique",
	"avivAngular.content.tasks.5": " Fonctionnement en guilde, et participation aux décisions architecturales",
	"avivAngular.end-time": "Septembre 2023",
	"avivAngular.enterprise": "Groupe Aviv",
	"avivAngular.start-time": "Décembre 2018",
	"avivAngular.title": "Développeur Frontend Angular (v6 - v17)",
	"avivReact.content.context": "Groupe spécialisé dans l'édition de sites web d’annonces immobilières",
	"avivReact.content.project": "Gestion du site dédié à l'acquisition des emplacements publicitaires sur les sites officiels du groupe AVIV et diffusion des campagnes publicitaires en direction des médias sociaux de Meta (Facebook et Instagram)",
	"avivReact.content.tasks.1": " Création et tests de composants, hooks, etc.",
	"avivReact.content.tasks.2": " Gestion d'état avec l'utilisation de contexts ou la consommation et l'hydratation de stores (Redux)",
	"avivReact.content.tasks.3": " Utilisation d'un design system élaboré par une team dédiée",
	"avivReact.content.tasks.4": " Implémentation de fonctionnalités d'une iframe pour la communication d'une app React au sein d'une app Angular",
	"avivReact.content.tasks.5": "Fonctionnement en guilde, contribution à l'implémentation de sujets transverses",
	"avivReact.end-time": "Novembre 2024",
	"avivReact.enterprise": "Groupe Aviv",
	"avivReact.start-time": "Septembre 2023",
	"avivReact.title": " Développeur Frontend React (v18)",
	"by": "par",
	"content-actions.education-and-trainings": "Éducation et formations",
	"content-actions.languages": "Langues",
	"content-actions.professional-experiences": "Expériences professionnelles",
	"content-actions.technical-skills": "Compétences techniques",
	"cvApp.content.context": "Projet personnel de présentation de mon savoir-faire technique en matière de développement web",
	"cvApp.content.project": "Application servant de curriculum vitae pour me présenter et présenter mon savoir faire technique en matière de programmation web. En attendant une prochaine mission, je me suis mis à développer cette application dont la finalité était d'être mise en ligne",
	"cvApp.content.tasks.1": "Développement, optimisation des fonctionnalités Frontend et utilisation prolifique de la libraire TailwindCSS",
	"cvApp.content.tasks.2": "Implémentation de la fonctionnalité de switch entre les modes clair et sombre",
	"cvApp.content.tasks.3": "Implémentation de la fonctionnalité de changement de langues (Français, Anglais et Néerlandais)",
	"cvApp.content.tasks.4": "Développement et optimisation de la couche backend en NodeJS et ExpressJS",
	"cvApp.content.tasks.5": "Écritures de tests unitaires et d'intégration visuelle du côté Angular",
	"cvApp.content.tasks.6": "Déploiement / mise en ligne de l'application",
	"cvApp.end-time": "Janvier 2025",
	"cvApp.enterprise": "Projet personnel",
	"cvApp.start-time": "Janvier 2025",
	"cvApp.title": "Développeur fullstack Angular (v19) / NodeJS",
	"education.institution": "Université technique des sciences appliquées de la Haye",
	"education.locality": "Delft",
	"education.section-title": "Éducation / Diplôme",
	"education.time": "Septembre 2014",
	"education.title": "Génie électrique",
	"education.type": "Bac + 4",
	"experiences.context": "Contexte :",
	"experiences.project": "Projet :",
	"experiences.tasks": "Tâches :",
	"experiences.till-now": "Aujourd'hui",
	"header.brightMode": "Mode clair",
	"header.darkMode": "Mode sombre",
	"intro.firstParagraph": "Je suis un développeur Frontend confirmé avec 7 années d'expérience en entreprise avec Angular (de la v2-bêta à la v17).\n Avec une base conséquente en TypeScript, je maîtrise aisément le couteau suisse qu'est Angular et en possède une riche \nconnaissance, de bonnes pratiques dans son utilisation quotidienne; notamment une compréhension approfondie de \nl'architecture basée sur les composants, de l'injection de dépendances (DI) et de l'utilisation de décorateurs.",
	"intro.quote": "« Tout ce que tu as appris jusqu’à présent n’a de sens que si cela trouve une application » ",
	"intro.secondParagraph": " En me plongeant, il y a un an, professionnellement dans l'écosystème de React, je souhaitais explorer ses \nfonctionnalités et philosophies uniques, telles que le DOM virtuel, TSX, les concepts de hooks, contexts, et autres pépites de \ncette librairie.",
	"intro.subtitle": " Développeur Frontend Angular confirmé - 7 années d'expérience",
	"intro.thirdParagraph": " Mais puisqu'il faut faire un choix ! Aujourd'hui avec l'émergence de l'IA partout autour de nous, et notamment Github Copilot qui \nassiste à merveille les développeurs, Angular redevient pour moi encore plus attrayant à cause de sa complétude et la \nréduction de sa 'complexité'. Puisque j'ai maintenant le luxe de me faire copiloter mon code, vaut mieux le faire à bord d'un \ngros Airbus A380 pour le défi, c'est-à-dire la machine complète que représente Angular.",
	"languages.dutch": "Néerlandais :",
	"languages.english": "Anglais :",
	"languages.french": "Français :",
	"languages.item-title": "Langue",
	"languages.verbalWeight-title": "Oral",
	"languages.writtenWeight-title": "Écrit",
	"page-not-found": "La page est introuvable.",
	"qDelft.content.context": " Éditeur de logiciels web",
	"qDelft.content.project": "Solution de gestion de carrière des enseignants (300 000 enseignants) pour le CIBG (organe du ministère néerlandais de l’éducation, du sport et du bien-être) au sein d’une équipe de 15 personnes dont 8 développeurs",
	"qDelft.content.tasks.1": "Réalisation de composants réutilisables au sein d’une librairie UI",
	"qDelft.content.tasks.2": "Implémentation de multiples fonctionnalités (notamment de recherche asynchrone au sein de l’application, de partage d’activité entre utilisateurs, fonctionnalité d’inscription, etc.)",
	"qDelft.end-time": "Octobre 2018",
	"qDelft.enterprise": "QDelft BV",
	"qDelft.start-time": "Mars 2017",
	"qDelft.title": "Développeur Angular  (v2 - v5)/.Net",
	"rights-reserved": "Tous droits réservés.  J’accepte que mes données personnelles soient traitées dans le cadre du processus de recrutement pour l’emploi auquel je postule.",
	"skills-table.challenges": "Défis",
	"skills-table.no": "Non",
	"skills-table.practicalWeight": "Beaucoup appliqué dans la pratique",
	"skills-table.skill": "Compétence",
	"skills-table.theoryWeight": "Bonnes notions théoriques",
	"skills-table.usedInThisApp": "Utilisé dans cette application de CV",
	"skills-table.yes": "Oui",
	"trainings.angular.advanced": "Angular - Avancé",
	"trainings.angular.complete-guide": "Angular - Le guide complet (Édition 2024)",
	"trainings.angular.crash-course": "Angular - Cours intensif pour les développeurs occupés",
	"trainings.mvc.asp-net": "Le cours complet ASP.NET MVC 5",
	"trainings.node": "Node.JS",
	"trainings.title": "Formations"
}
