{
	"an-error-occured": "Er is een fout opgetreden; probeer het later opnieuw.",
	"avivAngular.content.context": " Groep gespecialiseerd in het publiceren van websites voor vastgoedadvertenties",
	"avivAngular.content.project": " Beheer van de site gewijd aan vastgoedprofessionals (backoffice) en de site voor het indienen van huur-, lijfrente- en verkoopadvertenties voor professionals en particulieren, binnen een multidisciplinair team van tamelijk variabele omvang in de tijd (dus de geschiktheid om zowel in een redelijk groot team en om als enige front-end ontwikkelaar in het team te werken)",
	"avivAngular.content.tasks.1": "Ontwikkelen, onderhouden, optimaliseren en testen van applicaties",
	"avivAngular.content.tasks.2": "Bijdrage, implementatie van nieuwe functionaliteiten (door componenten op hoog en laag niveau te creëren; door hulpprogramma's services te schrijven en te consumeren of communicatie met de backend, enz.) in een bibliotheekarchitectuur, in het bijzonder een UI-bibliotheek (design-system)",
	"avivAngular.content.tasks.3": " Technische ontwikkeling van applicatieteststrategiearchitectuur (unittesten, integratietesten, e2e)",
	"avivAngular.content.tasks.4": "Documentatie, coaching, technische ondersteuning",
	"avivAngular.content.tasks.5": " Operaties als gilde en deelname aan architecturale beslissingen",
	"avivAngular.end-time": "September 2023",
	"avivAngular.enterprise": "Aviv-groep",
	"avivAngular.start-time": "December 2018",
	"avivAngular.title": "Angular Frontend-ontwikkelaar (v6 - v17)",
	"avivReact.content.context": "Groep gespecialiseerd in het publiceren van websites voor vastgoedadvertenties",
	"avivReact.content.project": "Beheer van de site gewijd aan de verwerving van advertentieruimtes op de officiële sites van de AVIV-groep en de distributie van advertentiecampagnes gericht op de sociale media van Meta (Facebook en Instagram)",
	"avivReact.content.tasks.1": " Creëren en testen van componenten, hooks, enz.",
	"avivReact.content.tasks.2": " Staatsbeheer (state management) met gebruik van contexts of consumptie en hydratatie van stores (Redux)",
	"avivReact.content.tasks.3": " Gebruik van een design system ontwikkeld door een toegewijd team",
	"avivReact.content.tasks.4": " Implementatie van iframe functionaliteiten voor het communiceren van een React app binnen een Angular app",
	"avivReact.content.tasks.5": "Gildewerking, bijdrage aan de implementatie van cross-functionele onderwerpen",
	"avivReact.end-time": "November 2024",
	"avivReact.enterprise": "Aviv-groep",
	"avivReact.start-time": "September 2023",
	"avivReact.title": "React Frontend-ontwikkelaar (v18)",
	"by": "door",
	"content-actions.education-and-trainings": "Onderwijs en trainingen",
	"content-actions.languages": "Talen",
	"content-actions.professional-experiences": "Professionele ervaringen",
	"content-actions.technical-skills": "Technische vaardigheden",
	"cvApp.content.context": "Persoonlijk project om mijn technische kennis op het gebied van webontwikkeling te tonen",
	"cvApp.content.project": "Applicatie die dient als curriculum vitae om mezelf voor te stellen en  mijn technische kennis op het gebied van webprogrammering te laten zien. Terwijl ik wachtte op een volgende missie, begon ik met het ontwikkelen van deze applicatie die tot doel had online te worden gezet",
	"cvApp.content.tasks.1": "Ontwikkeling, optimalisatie van frontend-functionaliteiten en productief gebruik van de TailwindCSS-bibliotheek",
	"cvApp.content.tasks.2": "Implementatie van de schakelfunctionaliteit tussen lichte en donkere modi",
	"cvApp.content.tasks.3": "Implementatie van de taalveranderingsfunctionaliteit (Frans, Engels en Nederlands)",
	"cvApp.content.tasks.4": "Ontwikkeling en optimalisatie van de backend-laag in NodeJS en ExpressJS",
	"cvApp.content.tasks.5": "Schrijven van unittests en visuele integratie aan de Angular-kant",
	"cvApp.content.tasks.6": "Implementatie en online zetten van de applicatie",
	"cvApp.end-time": "Januari 2025",
	"cvApp.enterprise": "Persoonlijk project",
	"cvApp.start-time": "Januari 2025",
	"cvApp.title": "Angular (v19) / NodeJS full-stack ontwikkelaar",
	"education.institution": "Haagse Hogeschool",
	"education.locality": "Delft",
	"education.section-title": "Opleiding / Diploma",
	"education.time": "September 2014",
	"education.title": "Elektrotechniek",
	"education.type": "HBO",
	"experiences.context": "Context:",
	"experiences.project": "Project:",
	"experiences.tasks": "Taken:",
	"experiences.till-now": "Heden",
	"header.brightMode": "Lichte modus",
	"header.darkMode": "Donkere modus",
	"intro.firstParagraph": "Ik ben een ervaren front-end ontwikkelaar met 7 jaar ervaring in het werken met Angular (van v2-beta tot v17).\n Met een solide basis in TypeScript heb ik het Zwitserse zakmes dat Angular is met gemak onder de knie gekregen, en ik heb een schat aan kennis en beste praktijken  in het dagelijkse gebruik ervan; waaronder een grondig begrip van de componentgebaseerde architectuur, afhankelijkheidsinjectie (DI) en het gebruik van decorators.",
	"intro.quote": "“Alles wat je tot nu toe hebt geleerd heeft pas zin als het een toepassing heeft” ",
	"intro.secondParagraph": " Toen ik mij een jaar geleden professioneel verdiepte in het React-ecosysteem, wilde ik de unieke kenmerken en filosofieën ervan verkennen, zoals de virtuele DOM, TSX, de concepten van hooks, contexten en andere parels van deze bibliotheek.",
	"intro.subtitle": " Senior Angular Frontend Developer - 7 jaar ervaring",
	"intro.thirdParagraph": " Maar aangezien men een keuze moet maken! Tegenwoordig met de opkomst van AI overal om ons heen, en in het bijzonder Github Copilot dat ontwikkelaars uitstekend ondersteunt, Angular wordt voor mij nog aantrekkelijker vanwege de volledigheid en de vermindering van de ‘complexiteit’ ervan. Omdat ik nu de luxe heb om mijn code mede te laten besturen, is het beter om dit aan boord van een grote Airbus A380 te doen voor de uitdaging, dat wil zeggen de complete machine die Angular vertegenwoordigt.",
	"languages.dutch": "Nederlands:",
	"languages.english": "Engels:",
	"languages.french": "Frans:",
	"languages.item-title": "Taal",
	"languages.verbalWeight-title": "Mondeling",
	"languages.writtenWeight-title": "Schrijven",
	"page-not-found": "De pagina kan niet worden gevonden.",
	"qDelft.content.context": " Uitgever van websoftware",
	"qDelft.content.project": "Applicatie voor lerarenloopbaanmanagement (300.000 leraren) voor het CIBG (orgaan van het Nederlandse Ministerie van Onderwijs, Sport en Welzijn) binnen een team van 15 mensen, waaronder 8 ontwikkelaars",
	"qDelft.content.tasks.1": "Creatie van herbruikbare componenten binnen een UI-bibliotheek",
	"qDelft.content.tasks.2": "Implementatie van meerdere functionaliteiten (waaronder asynchroon zoeken binnen de applicatie, delen van activiteiten tussen gebruikers, registratiefunctionaliteit, etc.)",
	"qDelft.end-time": "Oktober 2018",
	"qDelft.enterprise": "QDelft BV",
	"qDelft.start-time": "Maart 2017",
	"qDelft.title": "Angular  (v2 - v5)/.Net-ontwikkelaar",
	"rights-reserved": "Alle rechten voorbehouden. Ik ga ermee akkoord dat mijn persoonlijke gegevens worden verwerkt in het kader van het wervingsproces voor de functie waarop ik solliciteer.",
	"skills-table.challenges": "Uitdagingen",
	"skills-table.no": "Nee",
	"skills-table.practicalWeight": "Veel toegepast in de praktijk",
	"skills-table.skill": "Vaardigheid",
	"skills-table.theoryWeight": "Goede theoretische inzichten",
	"skills-table.usedInThisApp": "Gebruikt in deze CV-applicatie",
	"skills-table.yes": "Ja",
	"trainings.angular.advanced": "Angular - Geavanceerd ",
	"trainings.angular.complete-guide": "Angular - De complete gids (editie 2024)",
	"trainings.angular.crash-course": "Angular - Intensieve  cursus voor drukke ontwikkelaars",
	"trainings.mvc.asp-net": "De volledige ASP.NET MVC 5-cursus",
	"trainings.node": "Node.JS",
	"trainings.title": "Opleiding"
}
